---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.StairsCalculatorRules
source: html/7c0016f6-777d-d141-fcbc-364661ed8336.htm
---
# Autodesk.Revit.DB.GroupTypeId.StairsCalculatorRules Property

Calculation Rules.

## Syntax (C#)
```csharp
public static ForgeTypeId StairsCalculatorRules { get; }
```